// Решите загадку: Сколько чисел от 1 до 1000 содержат как минимум одну цифру 3?
// Напишите ответ здесь: 300
//#include <iostream>
//#include <string>
//
//using namespace std;
//
//int main() {
//	setlocale(LC_ALL, "RU");
//
//	int a = 1000;
//	int threes = 0;
//	for (int i = 1; i < a; ++i) {
//		string s = to_string(i);
//		for (char c : s) {
//			if (c == '3')
//				++threes;
//		}
//	}
//	cout << threes;
//	return 0;
//}
// Закомитьте изменения и отправьте их в свой репозиторий.
